
export const GuideStore = [
  {
    title: '关于应用中心',
    content: '云之家应用中心，为广大云之家用户提供涵盖协作、财务、人事、CRM\
          、金融服务等各类应用，帮助企业轻松实现移动办公。同时，基于云之家开放平台，\
          企业可通过自建应用连接业务系统，将内部的信息系统延伸到移动端，快速实现信息移动化。'
  },
  {
    title: '查看全部应用',
    content: '在应用中心添加应用后，可以通过【常用应用】卡片使用 应用',
    img: require('./imgs/1@2x.png')
  },
  {
    title: '如何添加管理应用',
    content: '非管理员用户可通过【已开通】可添加企业已开通应用； 管理员用户可在【已开通】中点击应用进入管理页面',
    img: require('./imgs/2@2x.png')
  },
  {
    title: '修改应用开通范围',
    content: '应用开通范围新增按用户角色开通，实现更灵活的应用开通模式',
    img: require('./imgs/3@2x.png')
  }
]
