/*****************************************************
图片统一放在imgs文件夹下，配置时只需改图片名，不要加路径
在线demo:
http://192.168.22.144/app-guide/index.html?type=fqa&appId=xiuxiu
****************************************************/

/**
 * 这是云之家头部标题
 */
export const title = '云之家电话'

/* 轻应用id */
export const appid = '10257'

// 不用管
export const type = 'fqa'

// 轻应用名字
export const appName = '云之家电话'

// 交流群的头像链接
export const groupHead = 'https://www.yunzhijia.com/image/5a0aa0d2e4b0602c99262f89_ext/5a0aa0dfe4b04d4fe6156a65'

// 交流群的二维码
export const QRCode = 'QR.png'

export const about = {
  banner: 'banener.png',
  question: '30秒了解云之家电话',
  answer: [
    {
      title: '流量话费全面省',
      content: '云之家内一键拨打，通话过程不耗流量和话费，音质高清、通话稳定',
      img: '1.png'
    },
    {
      title: '通话时长定量送',
      content: '每月最高赠送500分钟通话时长，随时随地省心通话',
      img: '2.png'
    },
    {
      title: '多样拨号，直通同事好友',
      content: '提供选择手机通讯录联系人或拨号盘直拨等多种拨号方式，联系同事、好友更简单',
      img: '3.png'
    },
    {
      title: '智能识别，来电不错过',
      content: '开启来电智能识别，同事、好友来电秒识别，重要来电不再错过',
      img: '4.png'
    },
    {
      title: '小贴士',
      content: [
        '1. 拨打免费电话后，需要接听云之家的回拨来电，才可顺利通话哦；',
        '2. 未认证团队每人每月赠送100分钟通话时长，认证团队每人每月赠送500分钟免费通话时长。'
      ]
    }
  ]
}

/*
带有换行文本和图片的模板
*/
const questions2 = [
  {
    question: '云之家电话可拨打的对象？',
    answer: [
      '1. 云之家企业通讯录和云之家外部好友；',
      '2. 手机通讯录联系人；',
      '3. 中国大陆地区手机号码、固定电话。'
    ]
  },
  {
    question: '如何使用云之家电话？',
    answer: [
      '1. 搜索同事或好友，从人员详情页或聊天窗口点击电话图标进行拨打；',
      '2. 点击云之家-通讯录-手机联系人，选择手机通讯录中的联系人进行拨打；',
      '3. 点击云之家-应用-云之家电话-直接拨号，通过拨号盘拨打任意电话。',
      '温馨提示：拨打免费电话后，需要接听云之家的回拨来电，才可顺利通话。'
    ]
  },
  {
    question: '云之家电话免费通话时长如何赠送？',
    answer: [
      '1. 未认证团队每人每月赠送100分钟通话时长，认证团队每人每月赠送500分钟免费通话时长。',
      '2. 多团队不叠加，每人每月最多拥有500分钟赠送时长（参加运营活动除外）；赠送时长每月月底清零。'
    ]
  },
  {
    question: '如何查询剩余通话时长？',
    answer: [
      '云之家移动端-云之家主页-应用-云之家电话-右上角“更多”-查看剩余时长。'
    ]
  },
  {
    question: '如果收不到回拨来电怎么办？',
    answer: [
      '1. 请确认当前登录的云之家账号和手机电话卡号码是否一致；若不一致，当前手机将无法收到回拨来电。',
      '2. 请确认手机电话卡没有欠费；若欠费，则无法收到运营商回拨给你的电话。',
      '3. 若前两点都正常，请点击云之家-我的-在线客服，在底部输入框反馈主叫手机号、被叫手机号与拨打时间，客服会尽快联系你进行处理。'
    ]
  },
  {
    question: '如果赠送时长使用完了怎么办？',
    answer: [
      '赠送的时长使用完毕后，需等到下月初赠送的通话时长到账才可继续使用云之家电话。'
    ]
  },
  {
    question: '云之家电话通话过程不消耗流量和话费吗？',
    answer: [
      '云之家电话在通话过程中是不消耗流量和话费的，但在拨打时需要流量来连接服务器，当然这个流量消耗是可以忽略不计的。'
    ]
  }
]

export const data = [
  {
    questions: questions2
  }
]
