/*****************************************************
 图片统一放在imgs文件夹下，配置时只需改图片名，不要加路径
 在线demo:
 http://192.168.22.144/app-guide/index.html?type=fqa&appId=xiuxiu
 ****************************************************/

/**
 * 这是云之家头部标题
 */
export const title = '关于同事圈'

/* 轻应用id */
export const appid = 'tribe'

// 不用管
export const type = 'fqa'

// 轻应用名字
export const appName = '同事圈'

// 交流群的头像链接
export const groupHead = 'http://yunzhijia.com/image/596c6bb9e4b04a6aa11ff355_ext/59b19084e4b04205828f7330'

// 交流群的二维码
export const QRCode = 'QR.png'

export const about = {
  banner: 'banner.jpg',
  question: '关于同事圈',
  answer: [
    {
      title: '关于同事圈',
      content: '与同事分享工作上的点点滴滴，打造更有活力、更有爱的团队'
    },
    {
      title: '发布动态',
      content: '随手与同事分享工作上的点点滴滴，打造更有活力，更有爱的团队'
    },
    {
      title: '心声社区',
      content: '匿名社交环境，' +
      '敢于把对工作环境、部门间合作关系和公司制度等，' +
      '与职场生活相关的看法大胆说出来为企业改进提供建议'
    },
    {
      title: '微信文章',
      content: '订阅分享微信好文章，分享到同事圈，全员共同学习'
    },
    {
      title: '生日祝福',
      content: '同事生日提醒，送个【生日祝福】，拉近同事间距离'
    },
    {
      title: '为他点赞',
      content: '给表现优秀的小伙伴点赞，让更多的人看到给予鼓励并向其学习'
    },
    {
      title: '话题',
      content: '建立话题可查看全部的话题，点击某个话题，可看到关于该话题的所有动态'
    },
    {
      title: '活力值',
      content: '根据云之家日常工作状态设计企业活力值，' +
      '      每个员工、每个部门的活力值排行，红包及时激励，' +
      '      激活个人、激活组织，赋予办公更多的激情'
    },
    {
      title: '勋章',
      content: '活力值勋章，自定义勋章和司龄勋章等，显示在个人头像旁，让你在职场社交中更具个性'
    }
  ]
}

/*
这个属于纯文本的模板，比较复杂的参考questions2的模板
*/
export const questions = [
  {
    question: '如何发表动态？',
    answer: '进入同事圈，点击右上角发布按钮可以发表动态在同事圈，' +
    '支持添加九张图片、表情、提及人和文件；支持添加地理位置、可见范围和添加话题'
  },
  {
    question: '如何正确使用心声社区？',
    answer: [
      '心声社区可以匿名发布，管理员并不知道发布的人是谁，请放心使用；',
      '心声社区是一个倾听基层心声的通路，在这里可以反馈问题、碰撞观点、对公司业务提出意见和建议；',
      '心声社区的秩序有赖于大家的共同维护，请不要攻击谩骂、宣泄不良情绪、发布违反国家法律的内容'
    ]
  },
  {
    question: '心声社区互动规则是什么？',
    answer: [
      '每次进入发布匿名动态时，都会分配一个新的匿名昵称和头像；',
      '为了对话不混乱，同一条匿名动态下同一个人发的内容会保持同一个匿名昵称；',
      '支持实名发帖和回复；',
      '匿名动态不会出现在您的个人动态中'
    ]
  },
  {
    question: '如何绑定微信帐号？',
    answer: '绑定微信账号，通过云之家—我的—我的收藏—设置（右上角），保存你的专属二维码，打开微信扫一扫扫描二维码就可以关注云之家公众号并绑定帐号，或者通过关注微信公众号—云之家（yzj_kf），点击底部栏绑定帐号进行绑定；'
  },
  {
    question: '如何分享微信文章到云之家同事圈？',
    answer: [
      '1 已绑定微信帐号',
      '2 开启收藏同步分享到同事圈，打开云之家-我的收藏-右上角的设置，开启【收藏并同步分享到同事圈】',
      '3 发送文章到云之家公众号，点击任一微信文章右上角【...】，向左滑动，选择【云之家】，微信文章即可分享到同事圈'
    ]
  },
  {
    question: '话题要如何使用？',
    answer: '在发表动态时，可以选择页面已有的热门话题或者通过输入两个##，在#中间插入话题。点击该话题，就可以进入话题页面查看该话题下所有的动态。'
  },
  {
    question: '如何查看活力值？',
    answer: '在我的—活力可以查看到相关活力值、活力榜'
  }
]

/*
带有换行文本和图片的模板
*/
export const questions2 = [
  {
    question: '同事圈管理员有哪些权限？',
    /* 换行文本如下 */
    answer: [
      '1  动态：可以删帖、置顶帖，首页话题设置；',
      '2  心声社区： 删帖；可以开启/关闭心声社区；允许匿名动态出现在首页; 热门心声动态是否推送给管理员',
      '3  禁言：可以对特定用户进行禁言',
      '4  团队账号：在网页端新建团队账号，修改或者删除；编辑团队管理成员；'
    ]
  },
  {
    question: '企业管理员有哪些权限？',
    answer: [
      '1  拥有同事圈管理员的所有权限',
      '2  增加或者删除同事圈管理员名单，增加或者删除发微博@all权限名单',
      '3  活力值配置，可在网页端云之家-管理中心-同事圈-活力值，设置相关活力值数值',
      '4  自定义勋章，可在网页端云之家-管理中心-同事圈-活力值，编辑自定义勋章并颁发给特定成员，颁发后勋章会显示在同事圈个人头像旁'
    ]
  }
]

/**
 * 定义分类，这是带分类的
 */
export const data = [
  {
    category: '常见问题',
    questions: questions
  },
  {
    category: '管理员权限',
    questions: questions2
  }
]

/**
 * 这是不带分类的
 */
/*
export const data = [
  {
    questions: questions
  }
]
*/
