/*****************************************************
图片统一放在imgs文件夹下，配置时只需改图片名，不要加路径
在线demo:
http://192.168.22.144/app-guide/index.html?type=fqa&appId=xiuxiu
****************************************************/

/**
 * 这是云之家头部标题
 */
export const title = '签到'

/* 轻应用id */
export const appid = 900001

// 不用管
export const type = 'fqa'

// 轻应用名字
export const appName = '签到'

// 交流群的头像链接
export const groupHead = 'https://yunzhijia.com/image/598d74f6e4b04cabfc2f68a4_ext/5a0d1d86e4b0011df0e1009a'

// 交流群的二维码
export const QRCode = 'QR.jpg'

/*
带有换行文本和图片的模板
*/
export const questions2 = [
  {
    question: '什么是外勤签到？',
    /* 换行文本如下 */
    answer: [

      '外勤签到是指定位到你现在所处的位置不在签到组规定的签到组范围内。该功能适合企业对需要外出的员工进行监管。'

    ]
  },

  {
    question: '什么是内勤签到？',
    /* 换行文本如下 */
    answer: [

      '内勤签到是指定位到所在的地点在规定的签到范围内。'

    ]
  },
  {
    question: '内外勤的工时是如何计算的？',
    /* 换行文本如下 */
    answer: [

      '内勤工时=最晚内勤打卡时间-最早内勤打卡时间',
      '外勤工时=最晚外勤打卡时间-最早内勤打卡时间'

    ]
  },

  {
    question: '什么是拍照签到？有什么用？',
    answer: [

      {
        content: [
          '拍照签到是正常内外勤签到的补充。是指利用拍照来记录现场位置的功能。在网络信号不好，定位不准的时候，我们就可以通过拍照签到来证实自己所在的位置。拍照签到记录需要负责人（包括兼职负责人；若无部门负责人，将由管理员审核）审核后才可作为有效记录。'

        ],
        img: '拍照签到.png'
      }

    ]
  },

  {
    question: '签到的时候定位不准确签到不成功要怎么办？',
    /* 换行文本如下 */
    answer: [

      '1，首先查看是否给应用开启了定位权限，gps定位开关是否打开，网络是否连通。',
      '2，可使用拍照签到保存自己所在的位置的证据和记录，在手机网络再次连通的时候会自动上传该签到记录。'

    ]
  },

  {
    question: '怎样查看我的签到记录？',
    answer: [
      {
        content: [
          '点击签到页面下方的签到统计，点击“个人”即可查看到自己详细的签到记录。'

        ],
        img: '我的签到1.jpg'
      },
      {
        img: '我的签到2.jpg'
      }
    ]
  },

  {
    question: '怎样查看部门下属的签到记录?',
    answer: [

      {
        content: [
          '点击签到页面下方的签到统计，点击“团体”即可查看到部门成员详细的签到记录。'

        ],
        img: '部门下属签到.jpg'
      }
    ]
  },

  {
    question: '如果忘记打卡了怎么办？',
    /* 换行文本如下 */
    answer: [

      '答：首先管理员需要在考勤状态管理中开启签到异常反馈确认，如果考勤忘记打卡，在个人的打卡记录中会显示缺卡，对于缺卡记录，我们可以对缺卡原因进行反馈。反馈的内容如果该部门有部门负责人会反馈到部门负责人，如果没有设置部门负责人，反馈的内容则会反馈到系统管理员。'
    ]
  },

  {
    question: '如何开启外勤确认',
    /* 换行文本如下 */
    answer: [

      '管理员在 签到-设置—考勤状态管理 打开外勤确认开关。开关开启之后，如果员工所在的部门有设置部门负责人，外勤记录会反馈到负责人进行审核，如果没有负责人外勤记录则会反馈到系统管理员审核。'

    ]
  },

  {
    question: '怎样设定考勤规则和考勤人员？',
    /* 换行文本如下 */
    answer: [
      {
        content: [
          '手机端设置教程：管理员点击 签到--设置--签到组管理—新建或者编辑签到组 即可设定签到组考勤规则和考勤人员。'
        ],
        img: '考勤规则1.jpg'
      },
      {
        img: '考勤规则2.jpg'
      },
      {
        content: [
          '网页端使用教程：管理员登录网页版云之家 点击 工作台—签到统计—签到管理—签到组管理即可设定签到组考勤规则和考勤人员。'
        ],
        img: '考勤规则3.png'
      },
      {
        img: '考勤规则4.png'
      }

    ]

  },

  {
    question: '什么是wifi签到？',
    /* 换行文本如下 */
    answer: [

      '答：Wifi签到是指连接指定的wifi后，手动点击签到就能进行签到的功能。'
    ]

  },

  {
    question: '如何如何添加wifi签到点？',
    /* 换行文本如下 */
    answer: [

      '答：手机端云之家点击 签到--设置--签到组管理—新建或者编辑签到组 添加wifi签到点，选取想要设定的wifi即可。'
    ]

  },

  {
    question: '怎样查看或者导出考勤人员的签到记录和统计记录？',
    /* 换行文本如下 */
    answer: [
      {
        content: ['管理员登录网页版云之家，点击每日签到记录，输入相应的人员信息，日期，考勤状态，点击查询即可获取相应的签到记录。点击右上角导出excel表格即可把签到记录导出到本地。'],

        img: '导出记录.png'
      }
    ]

  },

  {
    question: '如何查看员工签到异常设备信息',
    /* 换行文本如下 */
    answer: [

      '管理员进入网页版云之家，点击签到统计--异常签到分析 即可看到签到作弊的员工信息。'
    ]

  }
]

/**
 * 定义分类，这是带分类的
 */
export const data = [
  {
    questions: questions2
  }
]
