/*
这个属于纯文本的模板，比较复杂的参考store.js
*/

export const webViewTitle = '应用市场'

export const about = {
  question: '什么是应用市场？',
  // detail.vue中渲染的内容
  answer: [
    {
      title: '什么是应用市场？',
      content: '云之家应用市场，为广大云之家用户提供涵盖协作、财务、人事、CRM、金融服务等各类应用，通过一站式的移动应用服务帮助企业轻松实现移动办公。'
    }
  ]
}

export const questions = [
  {
    question: '1. 如何从应用市场添加应用？',
    answer: [
      {
        title: '如何从应用市场添加应用？',
        content: '用户可通过应用市场浏览或搜索获得所需应用，企业服务类的应用需管理员授权开通可进行使用，同时非管理员也可以申请开通自己需要使用的应用。'
      }
    ]
  },
  {
    question: '2. 添加应用后如何使用应用？',
    answer: [
      {
        title: '添加应用后如何使用应用？',
        content: '添加应用后，可通过“常用应用”卡片上使用应用，可通过卡片的“全部”使用未展示在常用应用上的应用。'
      }
    ]
  },
  {
    question: '3. 如何设置应用只对某部分特定员工可见？',
    answer: [
      {
        title: '如何设置应用只对某部分特定员工可见？',
        content: '管理员在开通应用时，可将应用按部门、成员或角色开通，设置开通范围后只有在可见范围内的用户可查看和使用该应用；在使用过程中，亦可随时修改应用可见范围。'
      }
    ]
  }
]
