/*****************************************************
图片统一放在imgs文件夹下，配置时只需改图片名，不要加路径
在线demo:
http://192.168.22.144/app-guide/index.html?type=fqa&appId=xiuxiu
****************************************************/

/**
 * 这是云之家头部标题
 */
export const title = '审批'

/* 轻应用id */
export const appid = '10104'

// 不用管
export const type = 'fqa'

// 轻应用名字
export const appName = '审批'

// 交流群的头像链接
export const groupHead = 'https://www.yunzhijia.com/image/5976b3e1e4b06d46e88bb893_ext/59c4af68e4b0778a35dd376e'

// 交流群的二维码
export const QRCode = 'QR.jpg'

/*
这个属于纯文本的模板，比较复杂的参考questions2的模板
*/
export const questions = [
  {
    question: '为什么发起流程时需要自己选择审批人及抄送人？',
    answer: [
      '由于管理员在配置审批模板时，未配置固定的审批流程，所以审批单据在发起时，需要发起人自行选择审批人；审批人在审批时，也可以自行选择下一级审批人。如果需要在审批单据办结的时候知会相关同事，可以将这部分人员设置为抄送人。',
      '如果发起时选择了多个审批人，则会根据所选的顺序依次进行流转到各个审批人。',
      '如果管理员已设置了具体的审批流程，则审批单据会根据已设置的流程进行流转。'
    ]
  },
  {
    question: '发起流程后，发现信息输入错误怎么办？',
    answer: [
      '流程发起后，如果下一级审批人未进行审批，此时可以撤回该审批单据。审批单据撤回后，发起人可以重新编辑该单据或删除该单据。',
      '如果下一级审批人已同意该审批，并且仍处于『审批中』状态，则可联系当前审批人将该单据退回至发起节点。审批单据被退回到发起节点后，发起人可以重新编辑该单据或删除该单据。',
      '小提示：在审批单据页面，点击审批人头像，即可查看该审批人的个人信息，并可直接发送消息给该审批人。'
    ]

  },
  {
    question: '审批人一直没审批怎么办？',
    answer: [
      '在审批过程中，经常会出现审批人未及时处理审批单据的情况，此时，作为发起人，我们除了保持一个良好稳定的心态之外，还可以有以下方法：',
      '1、进入审批单据页面，点击『催办』按钮，系统将会自动发送一条催办信息给到审批人，再次提醒审批人进行审批；',
      '2、在审批单据页面，点击审批人头像，即可查看该审批人的个人信息，并可直接发送消息给该审批人，进行人肉催办；',
      '3、如果审批人由于某些特殊原因，无法进行审批，可联系管理员，由管理员在 审批管理后台>审批流程管理>审批流程监控 中对审批流程进行强制流转。',
      '小提示：在云之家移动端的工作台页面，添加『审批追踪』卡片，即可了解到自己所发起的审批的处理现状，更可以在这个卡片上快速进行催办。'
    ]
  },
  {
    question: '流程运行时，没有匹配到审批人该怎么办？',
    answer: [
      '出现该问题的原因是由于流程配置有误，或组织架构有所调整。',
      '如果出现了此类异常，请立即联系管理员，由管理员在 审批管理后台>审批流程管理>审批异常处理 中找到这个单据并进行处理，并调整该模板的审批流程。'
    ]
  },
  {
    question: '审批完成的单据还能修改吗？',
    answer: [
      '为了保障业务信息的准确与安全，已经审批完成的单据是不允许修改的。如果担心该审批单据的内容有误，会影响到后续的业务统计，可以联系管理员，由管理员在 审批管理后台>审批流程管理>审批流程监控 中找到该单据并进行删除。',
      '在删除后的30天内，管理员都可以在 审批管理后台>审批流程管理>审批流程回收站 中进行恢复。不过在此还是需要奉劝一句：',
      '『删除有风险，手贱需谨慎！』'
    ]
  }
]

export const questions2 = [
  {
    question: '为什么审批流程时，需要选择下一级审批人？',
    answer: [
      '由于管理员在配置审批模板时，未进行固定的审批流程，所以审批单据在发起时，需要发起人自行选择审批人；审批人在审批时，也可以自行选择下一级审批人。',
      '如果发起时选择了多个审批人，则会根据所选的顺序依次进行流转到各个审批人。',
      '如果自己后面还有其他审批人，此时如果不手动添加下一级审批人，则会按照发起人选择的顺序继续流转到下一级审批人；如果后面没有其他审批人，此时如果不手动添加下一级审批人，则该流程会进入办结状态。',
      '如果管理员已设置了具体的审批流程，则审批单据会根据已设置的流程进行流转，不需要自己手动指定下一级审批人。'
    ]
  },
  {
    question: '审批过程中如何征询其他人的意见？',
    answer: [
      '审批人在做某些重要的审批决策时，往往需要收集多方面的信息，征询多方面的意见，包括单据内的内容，及其他审批人的意见。然而依据这些信息可能不足以做出最终的决策，此时可以征询其他人员的意见。',
      '此时只需要将单据『分享』给其他同事，该同事可以查看这个单据的信息，并在单据中添加『反馈』意见，或是直接在会话中给予相关意见。',
      '『分享』按钮可以在单据右上方找到，点击『分享』并选择具体的人员或群组即可将单据分享给相关人员。'
    ]
  },
  {
    question: '『讨论』功能有什么用？',
    answer: [
      '部分流程（如发文审批、对外合作协议审批等）在审批时，需要针对审批的内容进行充分的讨论，并可能需要反复修改审批的内容。',
      '如果使用传统的逐级审批模式，由于内容的反复修改，可能需要所有审批人反复进行确认，流程效率非常低下。',
      '使用『讨论』功能，将创建一个包含发起人及所有审批人的讨论群组。审批人与发起人可在群组中针对审批事项进行充分讨论之后，再进行审批的决策，以此提高审批流程的效率。',
      '如果该审批流程启用了『讨论』功能，云之家将会对该群组的讨论内容进行存档，作为审批意见的辅助内容。打印单据时，可以扫描群聊记录二维码，查看该群聊的讨论记录。'
    ]
  },
  {
    question: '什么是加签？什么是高级加签？',
    answer: [
      '在审批过程中，当前审批人审核完成后，需要选择另外一个人进行确认，此时需要进行加签操作。',
      '如当前审批人没有办法对审批事项作出最终决策，此时可以将流程加签给上级领导，由上级领导做最终定夺；如领导审批时，由于对审批的业务不够了解，此时原则上进行同意，但将流程加签给了解该业务的员工，由该员工给出专业的意见。',
      '审批管理员在配置流程时，可设置某个节点的审批人能否进行加签操作。',
      '1. 『加签』是在当前审批节点增加其他审批人。',
      '2. 『高级加签』为『加签』的升级版，是在当前节点后面添加一个审批节点，并可设置该加签节点的审批类型（会签、或签等），选项更多，也更灵活。'
    ]
  },
  {
    question: '作为审批人，能否修改单据的内容？',
    answer: [
      '审批人默认是不允许修改单据内容，如果单据内容有误，一般是将流程退回到发起人，并由发起人重新编辑单据之后再提交。',
      '但在某些审批场景中，根据业务的要求，审批人确实需要修改或编辑审批单据的内容。',
      '如报销场景中，财务人员需要根据发票情况及报销标准等信息，对报销金额进行核减；如采购场景中，相关的采购人员需要补充采购金额等信息。',
      '在审批流程设计中，审批管理员可以针对每一个审批节点配置字段权限，包括可见权限及编辑权限。如不开放某字段的可见权限，则审批人在审批时看不到该字段的信息（可保障审批信息安全）；如开放某字段的编辑权限，则审批人在审批时，可修改该字段的信息。',
      '审批过程中，所有信息的修改记录，都可以在审批单据右上方的『表单修改日志』中进行查询。'
    ]
  }
]

export const questions3 = [
  {
    question: '如何设置审批模板及流程？',
    answer: [
      '作为系统管理员，您可以在云之家审批应用中的『模板库』看到各个行业的常用审批模板，直接查看并启用该模板，即可快速将其添加为您团队的审批模板。',
      '如果默认模板及模板库中的模板中并没有您需要的内容，或者想对已有的模板进行调整。您可以登录云之家网页版的审批管理后台，我们提供了强大的模板自定义功能，您可以设计出任何您想要的审批流程。',
      '1. 登陆云之家网页版(www.yunzhijia.com)，在工作台中找到『审批』应用，点击即可进入审批管理后台；',
      '2. 切换到『审批模板管理』，即可管理企业的审批模板；',
      '3. 如果需要新建审批模板，可点击『新建审批流程』。'
    ]
  },
  {
    question: '什么是自由流程？什么是固定流程？',
    answer: [
      '如果审批模板只配置了审批表单，未配置审批流程，则该模板为自由流；如果需要使用固定流程，可以在审批管理后台进行配置',
      '自由流程：需要由提交人或审批人自行选择下一级审批人，功能简单，适用于灵活的审批场景；',
      '固定流程：根据所设置的审批节点/条件规则/审批人等进行流转，功能强大，适用于规范的审批场景。'
    ]
  },
  {
    question: '如何下载及统计审批数据？',
    answer: [
      '作为审批管理员，如果你拥有某个审批模板的数据查看权限，则可以在 审批管理后台>审批模板统计 中，创建与该模板相关的统计报表，并设置相关的表头字段',
      '创建好报表之后，可通过发起人，发起时间等多种维度筛选单据信息，并导出所筛选出来的审批单据。',
      '如果下载下来的单据缺少某个字段的内容，可以在表头字段中将该字段加上。',
      '小提示：未发布及已删除的模板无法创建统计报表，已删除的表单控件无法添加到表头字段中。'
    ]
  },
  {
    question: '员工反馈流程异常了怎么办？',
    answer: [
      '审批过程中，出现审批异常的原因可能有：',
      '1、预置的审批人已离职；',
      '2、管理员在配置审批流程的时候，所设置的条件判断不完备，未包含所有可能的情况，导致当前单据在流转的时候，找不到下一级审批节点；',
      '3、如果该节点的审批人设置为某个角色，且角色的业务范围未覆盖发起人所包含的部门，则会出现匹配不到审批人的情况。',
      '如果出现了异常，请在 审批管理后台>审批流程管理>审批异常处理 中找到这个单据并进行处理。',
      '处理完异常单据后，需要排查异常出现的原因，并调整审批流程，以避免后续该问题继续出现。'
    ]
  },
  {
    question: '如何将模板的维护权限和统计权限授权给其他员工？',
    answer: [
      {
        title: '如何将模板的维护权限和统计权限授权给其他员工？',
        content: [
          '稍具规模的组织，往往需要多个成员进行流程的管理和维护，此时就需要进行管理权限的授权，管理员可以在 审批管理后台>审批设置 进行配置。'
        ]
      },
      {
        title: '审批超级管理员',
        content: [
          '1. 审批超级管理员权限同『云之家系统（团队）管理员』，拥有对所有模板管理的权限；',
          '2. 审批超级管理员拥有分配『审批普通管理员』、『审批统计分配』的权限。'
        ]
      },
      {
        title: '审批普通管理员',
        content: [
          '1. 审批普通管理员仅可管理自己创建的审批模板，且不能维护审批分类；',
          '2. 审批普通管理员仅拥有『审批统计分配』的权限。'
        ]
      },
      {
        title: '审批统计授权',
        content: [
          '1. 『系统（团队）管理员』、『审批超级管理员』可分配审批应用中任一模板给到某个用户，授权后被分配的用户就可以统计某个具体的模板了；',
          '2. 『审批普通管理员』，仅可分配自己创建的模板分配给某个用户，被分配的用户就可以统计某个具体的模板了。',
          '3.  模板统计数据范围：如设置请假申请为整个公司可统计，则统计者可统计所有数据；如设置为『市场部』则只能统计到发起人为『市场部』的数据。',
          '4. 可统计模板：用户可统计到某个模板。'
        ]
      }
    ]
  },
  {
    question: '作为管理员，我还有好多疑问该怎么办？',
    answer: [
      '你可以点击下方按钮，扫描二维码（或长按识别），加入云之家审批交流群，与我们联系~',
      '大吉大利，今晚吃鸡！'
    ]
  }
]

/*

带有换行文本和图片的模板

export const questions2 = [
  {
    question: '报表秀秀应用场景有哪些，目前有哪些功能已经上线？',
    // 换行文本如下
    answer: [
      '报表秀秀支持以下应用场景，其中部分上线。',
      '1. 通过和金蝶ERP连接，直接形成报表。目前和金蝶K/3 Wise打通，应用时通过安装云之家连接助手，实现和ERP的连接。',
      '2. 通过上传图片方式，可以是PPT或EXCEL截图，形成报表，该功能已经上线。',
      '3. 通过在移动端填报方式，形成特定主题的报表。支持从下至上的统计汇总功能，该功能尚未上线。'
    ]
  },
  {
    question: '报表秀秀和金蝶ERP的K/3 Wise打通，具体应用方式是怎样的？',
    answer: [
      {
        title: '连接ERP',
        content: '报表秀秀和金蝶ERP的K/3 Wise打通，具体应用方式如下'
      },
      {
        content: [
          '1. 扫码登陆云之家 Web 端',
          '2. 点击上方「工作台」中的「查看更多应用」'
        ],
        img: 'erp1.png'
      },
      {
        content: '3. 找到「报表秀秀」，并点击进入',
        img: 'erp2.png'
      },
      {
        content: '4. 如果您是 K/3 WISE 的用户，请点击数据源页签，并下载「云之家连接助手」。将连接助手安装到 ERP 服务器。（如果您是非 K/3 WISE 的用户，请见本教程的第6点。）',
        img: 'erp3.png'
      },
      {
        content: '5. 完成数据同步，点击右上角的「替换报表数据源」，并且选择你需要的数据源。',
        img: 'erp4.png'
      },
      {
        content: '6. 如果您是非 K/3 WISE 的用户，点击右上角的「替换报表数据源」，下载 Excel 模板。并在模板内，填充数据。最后上传并提交 Excel 表格。',
        img: 'erp5.png'
      },
      {
        content: '7. 现在你可以在 Web 端看到漂亮的报表，或在移动端定时收到 ERP 的数据啦~',
        img: 'erp6.png'
      }
    ]
  }
]

*/

/**
 * 定义分类，这是带分类的
 */
export const data = [
  {
    category: '我是发起人',
    questions: questions
  },
  {
    category: '我是审批人',
    questions: questions2
  },
  {
    category: '我是管理员',
    questions: questions3
  }
]

/**
 * 这是不带分类的
 */
/*
export const data = [
  {
    questions: questions
  }
]
*/
